package com.tcloudsoft.utils.ex;

import lombok.Getter;

@Getter
public enum ResponseCodeEnum {

  A001("参数不允许为空"),

  C000000("请求成功"),

  C00001("用户名或者密码不能为空"),

  C00002("您的登录失效已过期或系统异常，请重新登录刷新再试"),

  C00003("密码错误"),

  C00004("用户不存在"),

  C00005("您的账户已被锁定，请%d秒后重试"),

  C00006("凭证已失效，请重新登录"),

  C00007("您的账号已在其他设备登录，请重新登录"),

  C00008("保存角色失败"),

  C00009("删除角色失败，请检查角色是否在使用中"),

  C00010("保存用户失败"),

  C00011("删除用户失败"),

  C00012("该用户已经被禁用"),

  C00013("同级菜单数已达上限"),

  C00014("同级部门数已达上限"),

  C00015("操作对象不存在"),

  C00016("无法获取用户角色"),

  C00017("数据异常"),

  C00018("当前登录用户密码错误"),

  C00019("您没有权限登录该系统"),

  C00020("获取用户凭证失败"),

  C00021("解析用户凭证失败"),

  C00035("您没有权限登录该系统,请检查该用户角色权限"),

  C30001("删除资产属性分类失败"),

  C30002("此分类中包含属性，不可删除"),

  C30003("新增或修改资产属性分类失败"),

  C30004("新增或修改失败"),

  C30005("删除失败"),

  C30006("修改资产属性排序失败"),

  C30008("新增或修改资产入库失败"),

  C30009("删除资产入库失败"),

  C30010("查询异常"),

  C30011("新增或修改资产内置入库失败"),

  C30012("查询单个资产内置列表失败"),

  C30013("新增/修改入库关联关系失败"),

  C30014("该资产有内置资产，不可删除"),

  C30015("该资产有关联关系，不可删除"),

  C30016("异动调和入库失败"),

  C30017("资产数量统计失败"),

  C30018("修改维保时间失败"),

  C30019("该标签已被使用，不可删除"),

  C30020("该关联关系比已满足"),

  C30021("任务名称不能为空"),

  C30022("该模型下有资产，不可删除"),

  C30023("该资产属内置资产，无详情"),

  C30024("操作对象模型不存在"),

  C30025("查询实时事件/历史事件失败"),

  C30026("查询事件管理-事件时间线分析失败"),

  C30027("查询事件管理-触发时间分析失败"),

  C30028("同步资产临过保/已过保数据失败"),

  C30029("CMDB调用异常"),

  C30030("查询检查项树形失败"),

  C30031("查询巡检预设类型下拉列表失败"),

  C30032("查询巡检对象下拉列表失败"),

  C30033("新增巡检任务失败"),

  C30034("编辑巡检任务失败"),

  C30035("查询巡检任务分页列表失败"),

  C30036("查询任务巡检历史执行记录失败"),

  C30037("查询巡检任务详情失败"),

  C30038("获取健康评估分类列表失败"),

  C30039("获取健康评估表格列表失败"),

  C30040("获取健康评估列表失败"),

  C30041("获取巡检实时结果失败"),

  C30042("统计最近30天预设类型失败"),

  C30043("巡检任务执行失败"),

  C30044("返回巡检检查结果失败"),

  C30045("审批告警事件失败"),

  C30046("拒绝审批时,审批原因不能为空"),

  C30047("该事件已审批，不可重复操作"),

  C30048("该巡检任务正在执行中，不可重复操作"),

  C30049("查询事件共线分析异常"),

  C30050("VC账户验证失败"),

  C300501("agent验证失败"),

  C30051("VC底层连接失败"),

  C30052("新增/修改阈值失败"),

  C30053("查询查询监控阈值类型失败"),

  C30054("运算符不为空请选多个类型"),

  C30055("查询查询监控阈值失败"),

  C30056("删除监控阈值失败"),

  C30057("未配置监控服务"),

  C30058("监控的数据源不存在"),

  C30059("无效的表达式"),

  C30060("该阈值已存在当前主机"),

  C30061("当前主机不存在或无法访问该主机"),

  C30062("无效的参数。该监控项不能取平均值"),

  C30063("调用ZABBIX监控阈值失败"),

  C30065("查询所需要同步的模型失败"),

  C30064("变更指定资产库模型失败"),

  C30066("查询所选择的配置项失败"),

  C30067("查询所选择的巡检对象失败"),

  C30069("资产库名称或所选数据源已存在，不允许重复"),

  C30070("该任务时间设置小于当前时间，请重新设置"),

  C30071("执行方案必选:执行一次或定时执行"),

  C30072("新增/修改网络失败"),

  C30073("删除网络失败"),

  C30074("该网络下面还有使用的ip，不可删除"),

  C30075("请检查输入的IP,是否与子网掩码支持的范围匹配"),

  C30076("查询网络失败!"),

  C30077("查询网段失败!"),

  C30078("修改ip状态失败!"),

  C30079("新增/修改网段失败!"),

  C30080("您输入的网络号重复,请检查!"),

  C30081("关联虚拟化网络失败!"),

  C30082("虚拟交换机模型或者vSphere模型不存在!"),

  C30083("虚拟交换机和vSphere关联关系不存在!"),

  C30084("查询虚拟化网络选中列表失败!"),

  C30085("查询节点详细信息失败!"),

  C00023("编辑资产分类失败!"),

  C00022("保存资产分类失败!"),

  C00024("删除资产分类失败!"),

  C00025("此分类中包含有模型，不能进行删除操作!"),

  C00026("保存资产类型失败!"),

  C00027("编辑资产类型失败!"),

  C00028("删除资产类型失败!"),

  C00029("资产类型唯一标识重复!"),

  C00030("父类的资产类型不能继承父类!"),

  C00031("此资产存在子类不能删除!"),

  C00032("此资产类型存在子类不能修改为父类！"),

  C00033("此资产类型存在属性不能删除!"),

  C00034("该需求已对接成功不能删除!"),

  C10000("缺少必传参数!"),

  GATEWAY00001("非法请求,无法获取认证信息"),

  C30007("该标识已被使用"),

  CMDB00001("此关联关系已存在!"),

  CMDB00002("保存任务失败!"),

  CMDB00003("删除任务失败!"),

  CMDB00004("暂停任务失败!"),

  CMDB00005("恢复任务失败!"),

  CMDB00006("中断任务失败!"),

  CMDB10001("保存资产通用属性失败！"),

  CMDB10002("编辑资产通用属性失败！"),

  CMDB10003("删除资产通用属性失败！"),

  CMDB10004("真实属性名重复！"),

  CMDB10005("该属性组下还存在属性！"),

  CMBD10006("资产关联关系不存在"),

  CMBD10007("资产模型不存在"),

  VMWARE10001("虚拟机核心数大于宿主机核心数，无法创建虚拟机"),

  VMWARE10002("只支持单Datacenter"),

  VM0001("虚拟机创建异常"),

  VM0002("虚拟机关闭电源异常"),

  VM0003("虚拟机打开电源异常"),

  VM0004("虚拟机关机异常"),

  VM0005("挂起虚拟机异常"),

  VM0006("重启虚拟机异常"),

  VM0007("销毁虚拟机异常"),

  VM0008("VMware虚拟机不支持虚拟机恢复操作"),

  VM0009("模板转虚拟机异常"),

  VM0010("虚拟机转模板异常"),

  VM0011("虚拟机快照创建异常"),

  VM0012("虚拟机快照重命名异常"),

  VM0013("恢复虚拟机快照异常"),

  VM0014("删除虚拟机快照异常"),

  VM0015("删除虚拟机所有快照异常"),

  VM0016("虚拟机配置调整异常"),

  API001("接口鉴权失败"),

  MNTI0001("操作异常，请联系系统管理员"),

  MNTI0002("读取资产类型与模型数据失败"),

  MNTI0003("新增监控数据源失败"),

  MNTI0004("更新监控数据源失败"),

  MNTI0005("参数值超出范围"),

  MNTI0006("取消资产关联失败"),

  MNTI0007("操作异常"),

  MNTI0008("登录监控服务器未成功"),

  MNTI0009("启用监控任务失败"),

  MNTI0010("更新监控任务失败"),

  OPS0001("资产编排名称不允许重复"),

  OPS0002("执行脚本名称不允许重复"),

  OPS0003("该知识产权已被转化，不可删除"),

  OPS0004("该企业已被删除，无法进行转化"),

  OPS0005("该需求已被对接，不可再次对接"),

  OPS0006("手机号码与该学者不匹配，请核对！"),

  DEM001("该需求已对接，不能删除！"),

  PRO1001("该知识产权已被转化，不可再转化"),

  PRO1002("您已收藏过该知识产权，不可再收藏"),

  UP0001("上传失败"),

  UP0002("请选择要上传的文件，再进行上传"),

  MYSQL001("该主键不存在，请检查后重新输入！"),

  MYSQL002("未添加列信息，请先添加！"),

  MYSQL003("请先添加数据源信息！"),

  MYSQL004("数据源信息内容有误，请检查后重新输入"),

  MYSQL005("请先选择要对mysql数据库的操作类型！"),

  MYSQL006("请先选择要操作的表格！");

  private String message;

  private ResponseCodeEnum(String message) {
    this.message = message;
  }

}
